{"name":"settings","description":"Settings database for search","items":[{"id":"2ae940902d4429df","page":"attachments","tab":"general","label":"Enable Attachments","description":"If enabled, users are allowed to upload files in their questions","keywords":"enable attachments enabled users are allowed upload files their questions"},{"id":"78b888a3caac942e","page":"attachments","tab":"general","label":"Enforce Attachment Limit","description":"Determines if EasyDiscuss should restrict the number of attachments allowed. If you would like to set a limit, set the limit below.","keywords":"enforce attachment limit the set limit determines easydiscuss should restrict number attachments allowed"},{"id":"51af44d721b46e7b","page":"attachments","tab":"general","label":"Attachments Limit","description":"Specify the number of attachment each post can attach. To disable the limit, disable the option <b>Enforce Attachment Limit<\/b>","keywords":"attachments limit the attachment disable specify number each post can attach limit"},{"id":"d37cb326eb6b6b73","page":"attachments","tab":"general","label":"Maximum Size Allowed","description":"Set the maximum size allowed for each files uploaded","keywords":"maximum size allowed set the maximum size allowed for each files uploaded"},{"id":"27a22458d42162fe","page":"attachments","tab":"general","label":"Storage Path","description":"In this section, you may set the relative path to the attachments storage","keywords":"storage path the this section you may set relative path attachments storage"},{"id":"243a11b5ff5a5a6b","page":"attachments","tab":"general","label":"Allowed File Extensions","description":"This option is to specify which extension you would like to allowed the user to upload. Separate each extention with a comma.","keywords":"allowed file extensions this the with extention each separate upload user allowed option"},{"id":"5c5cc3edfb6646a4","page":"attachments","tab":"general","label":"Enable Image Optimization for Attachments","description":"When this option is enabled, EasyDiscuss will send images to be optimized to StackIdeas Image Optimizer Server","keywords":"enable image optimization for attachments when this option enabled easydiscuss will send images optimized stackideas"},{"id":"32e245daf3c72e31","page":"attachments","tab":"general","label":"Optimize Images During Cron","description":"This option determines if EasyDiscuss should automatically optimize images during the cronjob process. When enabled, EasyDiscuss will locate images from the attachments that are not compressed yet and try to compress them","keywords":"optimize images during cron easydiscuss images the this from compress try and yet compressed"},{"id":"2834119d1f20f6b1","page":"attachments","tab":"general","label":"Image Compression Service Key","description":"Enter the service key that is provided to you on your StackIdeas Image Compression Service page","keywords":"image compression service key service enter the key that provided you your stackideas image"},{"id":"160d825aa8807688","page":"attachments","tab":"general","label":"Show Image Title","description":"If enabled, it will show image title in the image attachment.","keywords":"show image title image enabled will show title the attachment"},{"id":"7e2708aeb65763c5","page":"attachments","tab":"storage","label":"Attachments","description":"Select the storage location for attachments.","keywords":"attachments select the storage location for attachments"},{"id":"bf7b336739451398","page":"attachments","tab":"storage","label":"Enable Amazon S3","description":"This option determines if the Amazon S3 storage is turn on.","keywords":"enable amazon this option determines the amazon storage turn"},{"id":"b75e89e9de2c2296","page":"attachments","tab":"storage","label":"Use SSL Layer","description":"Turn on SSL layer.","keywords":"use ssl layer turn ssl layer"},{"id":"4356e9a17ebe7a99","page":"attachments","tab":"storage","label":"Access Key ID","description":"Please enter the Amazon S3 access key.","keywords":"access key please enter the amazon access key"},{"id":"5eb6bb157528b365","page":"attachments","tab":"storage","label":"Secret Key","description":"Please enter the Amazon S3 secret key.","keywords":"secret key please enter the amazon secret key"},{"id":"f7e531a14f551859","page":"attachments","tab":"storage","label":"Bucket Path","description":"Please enter the Amazon S3 bucket path.","keywords":"bucket path please enter the amazon bucket path"},{"id":"bf43a2887b992e92","page":"attachments","tab":"storage","label":"Storage Region","description":"Select the storage region.","keywords":"storage region select the storage region"},{"id":"563907664147878e","page":"email","tab":"general","label":"Test Connection","description":"If you are unsure if your accounts are setup correctly, click on the Test button here","keywords":"test connection are you unsure your accounts setup correctly click the test"},{"id":"9ea323c6c028fc0b","page":"email","tab":"general","label":"Enable E-mail Parser","description":"If enabled, EasyDiscuss will fetch emails from the email address that you have specified and post them as questions or replies.","keywords":"enable email parser enabled you questions them post and specified have that easydiscuss"},{"id":"4634e67d493cb623","page":"email","tab":"general","label":"Mail Server Address","description":"Specify the mail server address that your hosting provider has provided you.","keywords":"mail server address specify the mail server address that your hosting provider has"},{"id":"455efced76ad2ba7","page":"email","tab":"general","label":"Mail Server Port","description":"Specify the port used for all incoming connections for your mail service.","keywords":"mail server port for specify the port used all incoming connections your mail"},{"id":"926ac98534338902","page":"email","tab":"general","label":"Mail Service Type","description":"Specify the mail service type used. It is recommended to use IMAP.","keywords":"mail service type specify the mail service type used recommended use imap"},{"id":"29efc1c532964b2a","page":"email","tab":"general","label":"Use SSL","description":"Use Secure Transport Layer for the connection. You will need to ensure that your hosting provider supports this.","keywords":"use ssl use need supports provider hosting your that ensure will secure"},{"id":"bc6d1e9039e1d951","page":"email","tab":"general","label":"Validate Certificates","description":"Some email hosting requires that you validate the certificates upon connecting. If they do not have their own signed certificates, disable this option","keywords":"validate certificates certificates some they this disable signed own their have not"},{"id":"ba02404085da46fb","page":"email","tab":"general","label":"Username (Email Account)","description":"Set the username for your email account","keywords":"username email account set the username for your email account"},{"id":"dc647eb65e6711e1","page":"email","tab":"general","label":"Password","description":"Set the password for the email account","keywords":"password the set password for email account"},{"id":"d506e4610a57339d","page":"email","tab":"general","label":"E-mails To Process","description":"Set the number of emails that should be processed every time the cronjob is executed","keywords":"emails process the set number emails that should processed every time cronjob"},{"id":"21fb2a9675f8268e","page":"email","tab":"general","label":"Map E-mail To User Account","description":"When the user uses the same e-mail address as their account on the site, enabling this option will ensure that the post or reply to be associated with their account","keywords":"map email user account the account their when option associated reply post that ensure"},{"id":"94bcb850ded173d3","page":"email","tab":"general","label":"Append E-mail Address In Content","description":"When this option is activated, the user's e-mail address will be appended into the content","keywords":"append email address content the when this option activated users email address will appended"},{"id":"6fc785ba50b18d4d","page":"email","tab":"general","label":"Send Notification Receipt","description":"If enabled, EasyDiscuss will send a notification receipt to the sender when their email is parsed.","keywords":"send notification receipt enabled easydiscuss will send notification receipt the sender when their"},{"id":"beabd33a7a1f3340","page":"email","tab":"general","label":"Parse Replies","description":"If enabled, replies will also be parsed and included as a reply to the main discussion post.","keywords":"parse replies enabled replies will also parsed and included reply the main"},{"id":"d3bd570984cdf2da","page":"email","tab":"general","label":"Reply Break","description":"Works like page break, reply break identify the end of the reply. Anything defined break will be trimmed from the reply. Useful to exlclude previous replies in the email.","keywords":"reply break the break reply works trimmed replies previous exlclude useful from"},{"id":"9a2728ed1a6b831a","page":"email","tab":"general","label":"Moderate Parsed E-mails","description":"If enabled, the posts that are generated based on the emails will be unpublished by default.","keywords":"moderate parsed emails the enabled posts that are generated based emails will unpublished"},{"id":"daf7798deb2f4d69","page":"email","tab":"general","label":"Automatically Save Post In Category","description":"Select the desired category to save parsed mails into.","keywords":"automatically save post category select the desired category save parsed mails into"},{"id":"bea3184319f799fa","page":"email","tab":"general","label":"Sender White List","description":"Only email address in this white list are picked. Separate each email address with comma. Leave blank for no filter","keywords":"sender white list email address only this white list are picked separate each"},{"id":"1bdb40e0a2cec4ba","page":"email","tab":"general","label":"Sender Blacklist","description":"E-mail addresses in this list are blacklisted from the site. Separate each email address with comma. Leave blank for no filter","keywords":"sender blacklist email each for blank leave comma with address separate addresses"},{"id":"358f839a87b5f98f","page":"antispam","tab":"general","label":"Enable Word Filtering","description":"If enabled, words that are defined below will be filtered.","keywords":"enable word filtering enabled words that are defined below will filtered"},{"id":"6f15b8d4b7287d60","page":"antispam","tab":"general","label":"Words","description":"Specify the words that you want the system to filter","keywords":"words the specify words that you want system filter"},{"id":"665238f9b0a8b283","page":"antispam","tab":"general","label":"Minimum Discussion Title","description":"Set minimum requirement for discussion title (characters). Set 0 to disable this feature.","keywords":"minimum discussion title set minimum requirement for discussion title characters disable this feature"},{"id":"e4bc4d68ee802890","page":"antispam","tab":"general","label":"Minimum Post Length","description":"Configure the minimum length of content when create a new post. Leave empty or zero to disable this feature","keywords":"minimum post length configure the minimum length content when create new post leave"},{"id":"d2dd4fb774357d63","page":"antispam","tab":"general","label":"Enforce Maximum Characters on Post Title","description":"By enabling this option, EasyDiscuss will restrict the total number of characters the title is allowed to contain","keywords":"enforce maximum characters post title the enabling this option easydiscuss will restrict total number characters"},{"id":"797b3e214595e9df","page":"antispam","tab":"general","label":"Maximum Characters Allowed in Title","description":"This option determines the total number of characters allowed in the post title","keywords":"maximum characters allowed title the this option determines total number characters allowed post title"},{"id":"d10a8f3479901c52","page":"antispam","tab":"general","label":"Disallow Edit after Posting","description":"This option disallows users from editing their posts after they posted their post with the interval set below. This prevents spammers from modifying their posts in the future to a spammy message.","keywords":"disallow edit after posting their this the from posts spammy future modifying spammers prevents"},{"id":"e9c0feac96d9f358","page":"antispam","tab":"general","label":"Number of Days Before Disallowing Edit","description":"This is the number of days before users are disallowed to edit their post.","keywords":"number days before disallowing edit this the number days before users are disallowed edit their"},{"id":"12fc87eb7e67403a","page":"antispam","tab":"general","label":"Enable Honeypot Trap for Discussions","description":"When this option is enabled, honeypot trap will be activated for discussions","keywords":"enable honeypot trap for discussions when this option enabled honeypot trap will activated for discussions"},{"id":"80075f0c73ff5647","page":"antispam","tab":"general","label":"Enable Honeypot Trap for Replies","description":"When this option is enabled, honeypot trap will be activated for discussion replies","keywords":"enable honeypot trap for replies when this option enabled honeypot trap will activated for discussion"},{"id":"2a36cc8843794ecb","page":"antispam","tab":"general","label":"Enable Honeypot Trap for Comments","description":"When this option is enabled, honeypot trap will be activated for discussion comments","keywords":"enable honeypot trap for comments when this option enabled honeypot trap will activated for discussion"},{"id":"ffcb49902d6089ea","page":"antispam","tab":"general","label":"Akismet Integrations","description":"Enable Akismet integrations for the discussions. It will include filtering for both reply and new topic creations.","keywords":"akismet integrations for enable akismet integrations the discussions will include filtering both"},{"id":"3304eb635b0fb3fb","page":"antispam","tab":"general","label":"Akismet API Key","description":"You may obtain the API key from your account area.","keywords":"akismet api key you may obtain the api key from your account area"},{"id":"e8fabcf1e0548939","page":"antispam","tab":"general","label":"Cleantalk Integrations","description":"Enable Cleantalk integrations for the discussions. It will include filtering for both reply and new topic creations.","keywords":"cleantalk integrations for enable cleantalk integrations the discussions will include filtering both"},{"id":"2e3a68ed5a089edc","page":"antispam","tab":"general","label":"Access Key","description":"Set the access key that you've obtained from https:\/\/cleantalk.org","keywords":"access key set the access key that youve obtained from httpscleantalkorg"},{"id":"3fcc0dd29e91aa24","page":"antispam","tab":"captcha","label":"Captcha Image Type","description":"Select the captcha image type that should be used with EasyDiscuss","keywords":"captcha image type select the captcha image type that should used with easydiscuss"},{"id":"0af04678c4024fd8","page":"antispam","tab":"captcha","label":"Skip Captcha after Certain Post Count","description":"Allow user to skip recaptcha after certain number of posts.","keywords":"skip captcha after certain post count allow user skip recaptcha after certain number posts"},{"id":"37a7c771ccc741be","page":"antispam","tab":"captcha","label":"Enable Captcha Image For Registered Users","description":"If enabled, registered user will need to input captcha","keywords":"enable captcha image for registered users enabled registered user will need input captcha"},{"id":"37c5b6e7c4291021","page":"antispam","tab":"captcha","label":"Public Key","description":"Set the public key which Mollom has provided.","keywords":"public key set the public key which mollom has provided"},{"id":"d2560860c51f895a","page":"antispam","tab":"captcha","label":"Private Key","description":"Set the private key which Mollom has provided.","keywords":"private key set the private key which mollom has provided"},{"id":"08768d91aaaccf8e","page":"antispam","tab":"captcha","label":"Use Invisible Recaptcha","description":"When this option is activated, EasyDiscuss would render the invisible recaptcha instead","keywords":"use invisible recaptcha when this option activated easydiscuss would render the invisible recaptcha"},{"id":"c416a2ec6f070113","page":"antispam","tab":"captcha","label":"Invisible Recaptcha Placement","description":"This option determines where Recaptcha should place the Recaptcha badge on the site","keywords":"invisible recaptcha placement recaptcha the this option determines where should place badge site"},{"id":"afb849845fc147b4","page":"antispam","tab":"captcha","label":"Recaptcha Theme","description":"Select a recaptcha theme","keywords":"recaptcha theme select recaptcha theme"},{"id":"f9269df55a25a4e5","page":"antispam","tab":"captcha","label":"Recaptcha Language","description":"Select a recaptcha language","keywords":"recaptcha language select recaptcha language"},{"id":"4f84095f28f538bc","page":"general","tab":"general","label":"Enable Q & A","description":"Enable Question and answer behaviour","keywords":"enable enable question and answer behaviour"},{"id":"b0c75e0a0d8a7ac8","page":"general","tab":"general","label":"Enable Post Assignments","description":"This option determines if post assignments should be enabled in EasyDiscuss. Post assignments allow posts to be assigned to moderators on the site. This is rather useful if you are using EasyDiscuss as a support desk.","keywords":"enable post assignments this post assignments easydiscuss site support using are you useful"},{"id":"179d0ccf642ffaf0","page":"general","tab":"general","label":"Enable Private Postings","description":"If this option is enabled, the discussion will only be visible by the creator and the moderator of the category","keywords":"enable private postings the this option enabled discussion will only visible creator and"},{"id":"f657fd468082a70b","page":"general","tab":"general","label":"Enable Anonymous Postings","description":"When this option is enabled, user can choose to post anonymously. Their names and profile picture would be hidden from people.","keywords":"enable anonymous postings when names from hidden would picture profile and their this"},{"id":"60c6ca5c573b8e78","page":"general","tab":"general","label":"Enable Post Priority","description":"When this option is enabled, user's may choose a priority for their post.","keywords":"enable post priority when this option enabled users may choose priority for their"},{"id":"b2a48d419d3720f0","page":"general","tab":"general","label":"Enable Post Labels","description":"This option determines if post lables should be enabled in EasyDiscuss. If you do not intend to enable this feature, you can turn this off.","keywords":"enable post labels this you option determines post lables should enabled easydiscuss not"},{"id":"3af4abbc2486f20f","page":"general","tab":"general","label":"Enable Post Types","description":"If enabled, user will able to choose the post type when creating a new discussion.","keywords":"enable post types enabled user will able choose the post type when creating"},{"id":"5237f87012bf2eae","page":"general","tab":"general","label":"Enable Password Protection","description":"If enabled, users are allowed to password protect their discussions.","keywords":"enable password protection enabled users are allowed password protect their discussions"},{"id":"49dea79fe4ea2d08","page":"general","tab":"general","label":"Enable Points","description":"If enabled, user would be able to earn points and the points would appear in their profile.","keywords":"enable points would points enabled user able earn and the appear their"},{"id":"fdb742af65c80c7e","page":"general","tab":"general","label":"Enable User Badges","description":"If enabled, users would be able to earn badges and the badges would appear in their profile.","keywords":"enable user badges would badges enabled users able earn and the appear their"},{"id":"a014913c124e9f04","page":"general","tab":"general","label":"Enable Favourites","description":"If enabled, favourite will be present for the main discussion \/ question.","keywords":"enable favourites enabled favourite will present for the main discussion question"},{"id":"3fa5748a8d8c848f","page":"general","tab":"general","label":"Enable Ban Feature","description":"If enabled, EasyDiscuss will allow user have a ban feature.","keywords":"enable ban feature enabled easydiscuss will allow user have ban feature"},{"id":"0f011a425827f41a","page":"general","tab":"general","label":"Show Posts From Blocked Users","description":"If enabled, EasyDiscuss will display items posted from blocked users. These items include discussion posts, replies and comments.","keywords":"show posts from blocked users items enabled easydiscuss will display posted from blocked users these"},{"id":"d8cf9c7640069f50","page":"general","tab":"general","label":"Login To Read Full Post","description":"If enabled, guests are required to login in order to read the full post.","keywords":"login read full post enabled guests are required login order read the full post"},{"id":"cc9adcd682704ee3","page":"general","tab":"general","label":"Enable Reporting","description":"Enable or disable abuse report feature on post \/ replies entries. (You also need to enable in ACL)","keywords":"enable reporting enable disable abuse report feature post replies entries you also"},{"id":"83e0f07e0b2442d4","page":"general","tab":"general","label":"Report Threshold","description":"Specify the threshold for the number of reports. Once the threshold is reached, a notification will be sent to the site administrator.","keywords":"report threshold the threshold specify for number reports once reached notification will"},{"id":"7e2d95e6f9db599f","page":"general","tab":"general","label":"Enable Tagging","description":"Master settings of tags to enable or disable the whole tags system of EasyDiscuss.","keywords":"enable tagging tags master settings enable disable the whole system easydiscuss"},{"id":"98b8a533fb6067cd","page":"general","tab":"general","label":"Maximum Tags Allowed","description":"Configure maximum tag allow to add.","keywords":"maximum tags allowed configure maximum tag allow add"},{"id":"a9fc9cc52ca89df5","page":"general","tab":"general","label":"Enable Ratings","description":"If enabled, ratings form will be present for the main question.","keywords":"enable ratings enabled ratings form will present for the main question"},{"id":"7da2f5c654d51d9a","page":"general","tab":"general","label":"Allow Non Logged In Users To Rate","description":"If allowed, guests are allowed to rate discussion posts. It will be based on their session id.","keywords":"allow non logged users rate allowed guests are rate discussion posts will based their session"},{"id":"174299bdc3d41c97","page":"general","tab":"general","label":"Enable Custom Fields","description":"If enable, users able to use custom fields.","keywords":"enable custom fields enable users able use custom fields"},{"id":"d945db03b4b1dc4e","page":"general","tab":"general","label":"Show Custom Fields","description":"You may utilize the built in custom fields in EasyDiscuss to enhance the form.","keywords":"show custom fields the you may utilize built custom fields easydiscuss enhance form"},{"id":"53630acb6cfe438a","page":"general","tab":"general","label":"Enable Likes for Discussions","description":"If enabled, likes will be present for the main discussion \/ question.","keywords":"enable likes for discussions enabled likes will present for the main discussion question"},{"id":"80f7a37c073e031e","page":"general","tab":"general","label":"Enable Likes for Replies","description":"If enabled, likes will be present for the discussion replies","keywords":"enable likes for replies enabled likes will present for the discussion replies"},{"id":"6fbdfc9a15ba83e6","page":"general","tab":"comments","label":"Enable Comments For Questions","description":"Enable or disable your site members to comment post entries. If you choose No, all comments and comment forms will not be shown in post","keywords":"enable comments for questions post comment enable all not will forms and comments you"},{"id":"23695cd670e89b4b","page":"general","tab":"comments","label":"Enable Comments For Replies","description":"Enable or disable your site members to comment reply entries. If you choose No, all comments and comment forms will not be shown in reply","keywords":"enable comments for replies reply comment enable all not will forms and comments you"},{"id":"7d8510317ebb6e90","page":"general","tab":"comments","label":"Display Permalink in Comments","description":"This option determines if the permalink link should be visible in comments","keywords":"display permalink comments this option determines the permalink link should visible comments"},{"id":"cacaf4de3ee0e4b0","page":"general","tab":"comments","label":"Comment Ordering","description":"This option allows you to set the ordering of the comments to show on the post page.","keywords":"comment ordering the this option allows you set ordering comments show post"},{"id":"6de18c46304a7355","page":"general","tab":"comments","label":"Enable Pagination","description":"Enabling this option will enable the load more button for comments when the number of comments exceeds the limit specified below","keywords":"enable pagination the comments enabling specified limit exceeds number when button for"},{"id":"020d7cbae25f1dc9","page":"general","tab":"comments","label":"Comments Limit","description":"This option determines the total number of comments that will be loaded initially and every subsequent load more clicked","keywords":"comments limit this loaded more load subsequent every and initially will option"},{"id":"ac44d3ec5efadf62","page":"general","tab":"conversations","label":"Enable Conversations","description":"If enabled, users would be allowed to send message to one another.","keywords":"enable conversations enabled users would allowed send message one another"},{"id":"6ea3b1ebf85d183a","page":"general","tab":"conversations","label":"Notification For New Conversations","description":"If this is enabled, user will be notified in the toolbar when they receive a new message.","keywords":"notification for new conversations this enabled user will notified the toolbar when they receive"},{"id":"27abebf5f44ae338","page":"general","tab":"conversations","label":"Notification Interval","description":"Specify the interval for the system to check for new messages.","keywords":"notification interval the for specify interval system check new messages"},{"id":"09a272a9a5124a7c","page":"general","tab":"conversations","label":"Number of recent items","description":"Set the number of message items to be displayed in the dropdown.","keywords":"number recent items the set number message items displayed dropdown"},{"id":"db0afa3f5796914f","page":"general","tab":"location","label":"Enable Location Services For Questions","description":"By allowing location tagging on discussions, users would be able to tag their location when creating a new discussion on the site.","keywords":"enable location services for questions location allowing tagging discussions users would able tag their when"},{"id":"a7b127450d4a9359","page":"general","tab":"location","label":"Enable Location Services For Replies","description":"By allowing location tagging on replies, users would be able to tag their current location when posting a reply for a specific discussion.","keywords":"enable location services for replies location allowing tagging replies users would able tag their current"},{"id":"7d5da34261e31dd4","page":"general","tab":"location","label":"Google Maps API Keys","description":"Place your google maps api key here. You can obtain the key from google console.","keywords":"google maps api keys google key place your maps api here you can obtain"},{"id":"698da1d6435dc8a6","page":"general","tab":"location","label":"Use Static Maps","description":"If enabled, EasyDiscuss will use a static image map instead.","keywords":"use static maps enabled easydiscuss will use static image map instead"},{"id":"32e24b0772629ec4","page":"general","tab":"location","label":"Language Code","description":"Enter the language locale to be used for the maps.","keywords":"language code the enter language locale used for maps"},{"id":"ad0758b3464113f3","page":"general","tab":"location","label":"Map Type","description":"Set the default map type to be used.","keywords":"map type set the default map type used"},{"id":"0270d9e07a4234a7","page":"general","tab":"location","label":"Default Zoom Level","description":"Set the default zoom level for the map","keywords":"default zoom level the set default zoom level for map"},{"id":"edaa29595ce2f156","page":"general","tab":"polls","label":"Enable Polls For Questions","description":"If enabled, users are allowed to create polls when creating a new discussion.","keywords":"enable polls for questions enabled users are allowed create polls when creating new discussion"},{"id":"c934e18bc0d2a478","page":"general","tab":"polls","label":"Enable Polls For Replies","description":"If enabled, users are allowed to create polls when replying to a discussion.","keywords":"enable polls for replies enabled users are allowed create polls when replying discussion"},{"id":"a18ea0da57a6a4a5","page":"general","tab":"polls","label":"Allow Multiple Votes","description":"If enabled, users are allowed to vote on multiple vote options.","keywords":"allow multiple votes vote enabled users are allowed multiple options"},{"id":"53d2b268fa6b471e","page":"general","tab":"polls","label":"Allow Guests To Vote","description":"If enabled, guests are able to vote on polls.","keywords":"allow guests vote enabled guests are able vote polls"},{"id":"2530caa89ba70985","page":"general","tab":"polls","label":"Allow Polls To Be Locked","description":"If enabled, site admins, moderators and owner able to lock polls.","keywords":"allow polls locked enabled site admins moderators and owner able lock polls"},{"id":"eb27e58f4955d55e","page":"general","tab":"socialbuttons","label":"Social Buttons Type","description":"Select the type of social buttons that you would like to display on the entry page.","keywords":"social buttons type the select type social buttons that you would like display"},{"id":"a915f7d0f8084884","page":"general","tab":"socialbuttons","label":"Admin ID","description":"If you have a Facebook account, set the administrator's id here. You can find the ID in Facebook","keywords":"admin you facebook the have account set administrators here can find"},{"id":"5b8931675e7d93fa","page":"general","tab":"socialbuttons","label":"Application ID","description":"If you have created a Facebook application, set the application ID here","keywords":"application application you have created facebook set the here"},{"id":"7ad4799b6de19433","page":"general","tab":"socialbuttons","label":"Load Opengraph Tags","description":"When this option is enabled, opengraph tags for Facebook will be generated for discussions on the site.","keywords":"load opengraph tags for when this option enabled opengraph tags facebook will generated"},{"id":"6c5d9cf57ecf48c5","page":"general","tab":"socialbuttons","label":"Load Facebook Scripts","description":"If disabled, the script all.js are not loaded on the site. Only switch this off when you have conflicts with 3rd party modules or components","keywords":"load facebook scripts the disabled modules party 3rd with conflicts have you when"},{"id":"5eec5828f8503264","page":"general","tab":"socialbuttons","label":"Enable Facebook Likes","description":"If enabled, EasyDiscuss will include Facebook likes in the discussion post page.","keywords":"enable facebook likes enabled easydiscuss will include facebook likes the discussion post page"},{"id":"aa76ecee6be637c5","page":"general","tab":"socialbuttons","label":"Show Share Button","description":"If enabled, EasyDiscuss will also include the Share button beside the Like button","keywords":"show share button the button enabled easydiscuss will also include share beside like"},{"id":"83cccf4d0f83339c","page":"general","tab":"socialbuttons","label":"Show Faces","description":"If enabled, profile pictures will be displayed when someone likes an item","keywords":"show faces enabled profile pictures will displayed when someone likes item"},{"id":"6f495b46a6752d0a","page":"general","tab":"socialbuttons","label":"Choose Verb","description":"Configure how verbs should be used in the Facebook like widget","keywords":"choose verb configure how verbs should used the facebook like widget"},{"id":"d721757161f7f70c","page":"general","tab":"socialbuttons","label":"Theme","description":"Configure how the Facebook like widget should look like","keywords":"theme like configure how the facebook widget should look"},{"id":"c07836e77439bfa5","page":"general","tab":"socialbuttons","label":"Publisher ID","description":"Enter your addthis publisher ID that is provided by AddThis.","keywords":"publisher addthis enter your publisher that provided"},{"id":"b82434b4a0820e6d","page":"general","tab":"socialbuttons","label":"Inline Share Buttons Widget ID For AMP","description":"Enter the widget ID of the inline share button that you want to display in AMP page from your AddThis dashboard.","keywords":"inline share buttons widget for amp the enter widget inline share button that you want display"},{"id":"8d32349be4979be1","page":"general","tab":"socialbuttons","label":"Floating Share Buttons Widget ID For AMP","description":"Enter the widget ID of the floating share button that you want to display in AMP page from your AddThis dashboard.","keywords":"floating share buttons widget for amp the enter widget floating share button that you want display"},{"id":"d57f0be56e6fb693","page":"general","tab":"socialbuttons","label":"Property ID","description":"Enter your sharethis property ID that is provided by ShareThis.","keywords":"property sharethis enter your property that provided"},{"id":"bf3d3c10dd5e8b15","page":"general","tab":"socialbuttons","label":"Use Twitter Button","description":"Enable or disable the Twitter button. When enabled, the Tweet button will appear on the question post page.","keywords":"use twitter button the button enable disable twitter when enabled tweet will appear"},{"id":"1043ca9fcf7cee3c","page":"general","tab":"socialbuttons","label":"Load Twitter Card in Page Headers","description":"When this option is activated, EasyDiscuss will render the necessary twitter card codes in the header of the page","keywords":"load twitter card page headers the when this option activated easydiscuss will render necessary twitter"},{"id":"c52ea9c79c76a90f","page":"general","tab":"socialbuttons","label":"Enable LinkedIn Button","description":"If enabled, LinkedIn button will be displayed in the discussion view.","keywords":"enable linkedin button enabled linkedin button will displayed the discussion view"},{"id":"cd98a64ee3cee839","page":"general","tab":"terms","label":"Enable Terms & Conditions For Question","description":"By enabling this option, user will require to abide to the terms & conditions specified below when posting a question.","keywords":"enable terms conditions for question enabling this option user will require abide the terms conditions"},{"id":"8f35dcf32214166d","page":"general","tab":"terms","label":"Enable Terms & Conditions For Reply","description":"By enabling this option, user will require to abide to the terms & conditions specified below when posting a reply.","keywords":"enable terms conditions for reply enabling this option user will require abide the terms conditions"},{"id":"ed4106c0285e6354","page":"general","tab":"terms","label":"Enable Terms & Conditions For Comment","description":"By enabling this option, user will require to abide to the terms & conditions specified below when posting a comment.","keywords":"enable terms conditions for comment enabling this option user will require abide the terms conditions"},{"id":"4b68f6c7957a25e3","page":"general","tab":"terms","label":"Remember Terms & Conditions Selection","description":"When enabled, user will only need to check once on the terms & condition selection box when submitting the question, reply or comment so that user will no longer need to check the selection box again in the future.","keywords":"remember terms conditions selection the when user will need check selection box reply again"},{"id":"d548ba090dc64f4e","page":"general","tab":"terms","label":"Remember Terms & Conditions selection based on","description":"Specify how the system will remember the terms and condition selection box.","keywords":"remember terms conditions selection based the specify how system will remember terms and condition selection"},{"id":"af2f738c39314bd1","page":"general","tab":"terms","label":"Terms & Conditions","description":"This will appear in the terms and condition dialog box","keywords":"terms conditions this will appear the terms and condition dialog box"},{"id":"2a32a626764d41e6","page":"general","tab":"votings","label":"Allow Voting On Own Posts","description":"This option determines if users on the site would be able to vote on their own posts","keywords":"allow voting own posts this option determines users the site would able vote their"},{"id":"1d9d2658241e1e6a","page":"general","tab":"votings","label":"Allow Voting On Main Question","description":"This option determines if voting should be enabled on the main post","keywords":"allow voting main question this option determines voting should enabled the main post"},{"id":"78f1bcfecf7e136a","page":"general","tab":"votings","label":"Allow Voting On Replies","description":"This option determines if voting is enabled for replies in a post","keywords":"allow voting replies this option determines voting enabled for replies post"},{"id":"8491fdc9fccf1676","page":"general","tab":"votings","label":"Allow Guests To View Voters","description":"This option determines if EasyDiscuss should allow non logged in users to view voters of the posts","keywords":"allow guests view voters this option determines easydiscuss should allow non logged users view"},{"id":"c3a6188887ea9e9a","page":"general","tab":"votings","label":"Allow Guests To Vote Main Question","description":"This option determines if non logged in users are allowed to vote on the main post","keywords":"allow guests vote main question this option determines non logged users are allowed vote the"},{"id":"ab51d5dcb633423b","page":"general","tab":"votings","label":"Allow Guests To Vote Replies","description":"This option determines if non logged in users are allowed to vote on replies of a post","keywords":"allow guests vote replies this option determines non logged users are allowed vote replies"},{"id":"8d8b122d2d96e699","page":"composer","tab":"general","label":"Redirection After Posting","description":"This option determines where the user should be redirected to after posting a new question successfully","keywords":"redirection after posting this option determines where the user should redirected after posting"},{"id":"add6873c4704a5cb","page":"composer","tab":"general","label":"Enable Mentions","description":"When this option is enabled, user's would be able to mention another person's name. The target will receive a notification when they are mentioned","keywords":"enable mentions when name are they notification receive will target the persons"},{"id":"94bcb850ded173d3","page":"composer","tab":"general","label":"Append E-mail Address In Content","description":"When this option is activated, the user's e-mail address will be appended into the content","keywords":"append email address content the when this option activated users email address will appended"},{"id":"717106c1211a2683","page":"composer","tab":"general","label":"Trigger Content Plugins For Posts","description":"If you rely on content plugins to replace content, you can enable this option so that the post would trigger content plugins in Joomla","keywords":"trigger content plugins for posts content you plugins rely replace can enable this option that"},{"id":"5991a89ab1bfb751","page":"composer","tab":"general","label":"Trigger Content Plugins For Replies","description":"If you rely on content plugins to replace content, you can enable this option so that the replies would trigger content plugins in Joomla","keywords":"trigger content plugins for replies content you plugins rely replace can enable this option that"},{"id":"7873edd158ac6222","page":"composer","tab":"general","label":"Trigger Content Plugins For Comments","description":"If you rely on content plugins to replace content, you can enable this option so that the comments would trigger content plugins in Joomla","keywords":"trigger content plugins for comments content you plugins rely replace can enable this option that"},{"id":"056dcd3e1d79f0b5","page":"composer","tab":"general","label":"Auto Lock New Post","description":"Automatically lock new posts when a post is created on the site.","keywords":"auto lock new post automatically lock new posts when post created the site"},{"id":"cf972fe88b0cd07e","page":"composer","tab":"general","label":"Days To Lock After Last Reply","description":"Lock the post the number of days from time of last reply. 0 to null this feature","keywords":"days lock after last reply the lock post number days from time last reply null"},{"id":"dfe7fd16498fe563","page":"composer","tab":"general","label":"Days To Lock After Created","description":"Days to lock the post the a number of days after created and reply. 0 to null this feature","keywords":"days lock after created days the lock post number after created and reply null"},{"id":"0a0d2db96301a670","page":"composer","tab":"editor","label":"Default Editor","description":"Select the editor that should be used in EasyDiscuss","keywords":"default editor select the editor that should used easydiscuss"},{"id":"d01ed11e4d1f8e4a","page":"composer","tab":"editor","label":"Show Bold Button","description":"This option determines if the bold button should be visible in the bbcode editor.","keywords":"show bold button the this option determines bold button should visible bbcode editor"},{"id":"27318c74ba0944b0","page":"composer","tab":"editor","label":"Show Italic Button","description":"This option determines if the italic button should be visible in the bbcode editor.","keywords":"show italic button the this option determines italic button should visible bbcode editor"},{"id":"0fdceb99408d5c0b","page":"composer","tab":"editor","label":"Show Underline Button","description":"This option determines if the underline button should be visible in the bbcode editor.","keywords":"show underline button the this option determines underline button should visible bbcode editor"},{"id":"d436dc21c994ed6d","page":"composer","tab":"editor","label":"Show Link Button","description":"This option determines if the link button should be visible in the bbcode editor.","keywords":"show link button the this option determines link button should visible bbcode editor"},{"id":"6f71709577fd1811","page":"composer","tab":"editor","label":"Show Image Button","description":"This option determines if the image button should be visible in the bbcode editor.","keywords":"show image button the this option determines image button should visible bbcode editor"},{"id":"3864821bd3717301","page":"composer","tab":"editor","label":"Show Video Button","description":"This option determines if the video button should be visible in the bbcode editor.","keywords":"show video button the this option determines video button should visible bbcode editor"},{"id":"f167a9544222686a","page":"composer","tab":"editor","label":"Show Bullet List Button","description":"This option determines if the bullet list button should be visible in the bbcode editor.","keywords":"show bullet list button the this option determines bullet list button should visible bbcode"},{"id":"3503e4cb2fad739f","page":"composer","tab":"editor","label":"Show Numeric List Button","description":"This option determines if the numeric list button should be visible in the bbcode editor.","keywords":"show numeric list button the this option determines numeric list button should visible bbcode"},{"id":"5bf3de97021c35ee","page":"composer","tab":"editor","label":"Show Table Button","description":"This option determines if the table button should be visible in the bbcode editor.","keywords":"show table button the this option determines table button should visible bbcode editor"},{"id":"5803a8974aba1117","page":"composer","tab":"editor","label":"Show Quote Button","description":"This option determines if the quote button should be visible in the bbcode editor.","keywords":"show quote button the this option determines quote button should visible bbcode editor"},{"id":"968861aae92872fa","page":"composer","tab":"editor","label":"Show Code Button","description":"This option determines if the code button should be visible in the bbcode editor.","keywords":"show code button the this option determines code button should visible bbcode editor"},{"id":"9cb6b4b53c1043a5","page":"composer","tab":"editor","label":"Show Emoji Button","description":"This option determines if the Emoji button should be visible in the bbcode editor.","keywords":"show emoji button the this option determines emoji button should visible bbcode editor"},{"id":"e793ae5704520576","page":"composer","tab":"editor","label":"Show Gist Button","description":"This option determines if the Gist button should be visible in the bbcode editor.","keywords":"show gist button the this option determines gist button should visible bbcode editor"},{"id":"3505210912c2f64a","page":"composer","tab":"editor","label":"Show GIPHY Button","description":"This option determines if the GIPHY button should show up in the editor","keywords":"show giphy button the this option determines giphy button should show editor"},{"id":"b63335051af7a3e3","page":"composer","tab":"editor","label":"Enable GIPHY","description":"Determine if the GIPHY feature should be enabled","keywords":"enable giphy determine the giphy feature should enabled"},{"id":"d876ff8da67c3731","page":"composer","tab":"editor","label":"API Key","description":"You may refer to our documentation on how to integrate GIPHY with EasyDiscuss.","keywords":"api key you may refer our documentation how integrate giphy with easydiscuss"},{"id":"bd9c8fe416083953","page":"composer","tab":"editor","label":"Total Items To Display In Selection","description":"This option determines the total number of GIFs and Stickers to be rendered in the GIF and Sticker selection respectively","keywords":"total items display selection the and this option determines total number gifs stickers rendered"},{"id":"00333843a8a6218f","page":"composer","tab":"editor","label":"Parse Twitter Links","description":"This option determines if EasyDiscuss will replace twitter links with embedded tweet cards","keywords":"parse twitter links this option determines easydiscuss will replace twitter links with embedded"},{"id":"01b57c8704fcb565","page":"composer","tab":"editor","label":"Parse Github Gist Links","description":"This option determines if EasyDiscuss will replace gist links with embedded codes from Github's Gist","keywords":"parse github gist links gist this option determines easydiscuss will replace links with embedded"},{"id":"5d90494dc28d5d43","page":"composer","tab":"editor","label":"Enable Syntax Highlighter","description":"If enabled, syntax highlighting will be loaded on the discussions page","keywords":"enable syntax highlighter enabled syntax highlighting will loaded the discussions page"},{"id":"6c806e7b406f9f85","page":"composer","tab":"editor","label":"Open Links In New Window","description":"If using built-in BBcode editor, Open links in the questions\/replies in new window","keywords":"open links new window using builtin bbcode editor open links the questionsreplies new window"},{"id":"9370a4ab88cedb51","page":"composer","tab":"editor","label":"Insert No-follow Attributes In Hyperlinks","description":"If enabled, all links generated from within the content will contain a rel=nofollow tag.","keywords":"insert nofollow attributes hyperlinks enabled all links generated from within the content will contain"},{"id":"a17a99c95adbe76b","page":"composer","tab":"editor","label":"Default Video Width","description":"Specify the default width of the video","keywords":"default video width the specify default width video"},{"id":"d302a6bdc47c06fa","page":"composer","tab":"editor","label":"Default Video Height","description":"Specify the default height of the video","keywords":"default video height the specify default height video"},{"id":"76525f0f34b48475","page":"composer","tab":"github","label":"Client ID","description":"Client ID","keywords":"client client"},{"id":"6c5562c545345e1e","page":"composer","tab":"github","label":"Client Secret Key","description":"Client Secret Key","keywords":"client secret key client secret key"},{"id":"79feaf8645529e68","page":"composer","tab":"github","label":"GitHub Authorization","description":"GitHub Authorization","keywords":"github authorization github authorization"},{"id":"be907aefd5df97b2","page":"composer","tab":"moderation","label":"Moderate New Questions","description":"When this option is enabled, all questions will be moderated by default.","keywords":"moderate new questions when this option enabled all questions will moderated default"},{"id":"34e8fedf570e4805","page":"composer","tab":"moderation","label":"Moderate New Replies","description":"When this option is enabled, all replies will be moderated by default.","keywords":"moderate new replies when this option enabled all replies will moderated default"},{"id":"9e1a1a5a8ff80fc8","page":"composer","tab":"moderation","label":"Enable Automated Moderation","description":"Turn on this option, should you want to moderate new users on the site to prevent spams.","keywords":"enable automated moderation turn this option should you want moderate new users the"},{"id":"36354cbb254943a9","page":"composer","tab":"moderation","label":"Questions Moderation Threshold","description":"Set a value for moderation threshold if you want to set the number of items a new question on the site before they become unmoderated. Leave it to 0 to disable moderation threshold.","keywords":"questions moderation threshold set moderation threshold the site leave unmoderated become they before"},{"id":"8b9bf09d48f32778","page":"composer","tab":"moderation","label":"Replies Moderation Threshold","description":"Set a value for moderation threshold if you want to set the number of items a new reply on the site before they become unmoderated. Leave it to 0 to disable moderation threshold.","keywords":"replies moderation threshold set moderation threshold the site leave unmoderated become they before"},{"id":"6b5decca0f8fd9b9","page":"integrations","tab":"altauserpoints","label":"Enable AUP","description":"Determines whether the system want to integrate with AltaUserPoints point system.","keywords":"enable aup system determines whether the want integrate with altauserpoints point"},{"id":"2512896c6d54fb13","page":"integrations","tab":"easyblog","label":"Display EasyBlog Menu's in Toolbar","description":"This option determines if EasyBlog menu items should be displayed in the dropdown toolbar","keywords":"display easyblog menus toolbar this option determines easyblog menu items should displayed the dropdown"},{"id":"26c1577a1b16b45b","page":"integrations","tab":"easysocial","label":"Display EasySocial Menu's in Toolbar","description":"This option determines if EasySocial menu items should be displayed in the dropdown toolbar","keywords":"display easysocial menus toolbar this option determines easysocial menu items should displayed the dropdown"},{"id":"60a085022ae83050","page":"integrations","tab":"easysocial","label":"Use EasySocial Edit Profile Link","description":"If this option is enabled, EasyDiscuss will link the edit profile link to EasySocial's form.","keywords":"use easysocial edit profile link link this option enabled easydiscuss will the edit profile easysocials"},{"id":"e9d38690f3482817","page":"integrations","tab":"easysocial","label":"Enable Popover Avatar","description":"When this option is enabled, hovering over an avatar will display a nice popover box which links to EasySocial.","keywords":"enable popover avatar when this option enabled hovering over avatar will display nice"},{"id":"9a1c1af8d2e03bca","page":"integrations","tab":"easysocial","label":"Use EasySocial Points System","description":"If this option is enabled, points will be integrated with EasySocial.","keywords":"use easysocial points system this option enabled points will integrated with easysocial"},{"id":"ee82bdc6a1cd8b52","page":"integrations","tab":"easysocial","label":"Use EasySocial Members","description":"If this option is enabled, members will be integrated with EasySocial.","keywords":"use easysocial members this option enabled members will integrated with easysocial"},{"id":"fb7d2edf047ee059","page":"integrations","tab":"easysocial","label":"Use EasySocial Conversations","description":"If this option is enabled, EasyDiscuss will use the conversatioins from EasySocial instead.","keywords":"use easysocial conversations this option enabled easydiscuss will use the conversatioins from easysocial"},{"id":"de9527f5314264fd","page":"integrations","tab":"easysocial","label":"Integrate With EasySocial Notifications","description":"When this option is enabled, EasyDiscuss will push notifications through EasySocial notifications system giving your users a more unified system.","keywords":"integrate with easysocial notifications system notifications when this option enabled easydiscuss will push through"},{"id":"c919eee0896ec00b","page":"integrations","tab":"easysocial","label":"Integrate With EasySocial Activity Stream","description":"When this option is enabled, EasyDiscuss will generate activity streams in EasySocial for activities generated in EasyDiscuss","keywords":"integrate with easysocial activity stream easydiscuss when this option enabled will generate activity streams easysocial"},{"id":"4063fa1d04a5f000","page":"integrations","tab":"google","label":"Enable Google Adsense","description":"Enable or disable Google adsense in EasyDiscuss.","keywords":"enable google adsense enable disable google adsense easydiscuss"},{"id":"0e566ead8009ed5c","page":"integrations","tab":"google","label":"Use Responsive Code","description":"If enabled, easydiscuss will use google adsense responsive code instead.","keywords":"use responsive code enabled easydiscuss will use google adsense responsive code instead"},{"id":"ee0916ad6b445f1e","page":"integrations","tab":"google","label":"Load Google Adsense scripts","description":"If disabled, the scripts <b>adsbygoogle.js<\/b> and <b>show_ads.js<\/b> are not loaded on the page. Only switch this off when you have load this scripts on your template.","keywords":"load google adsense scripts the scripts this disabled your load have you when off"},{"id":"cf9b022c7b8187ec","page":"integrations","tab":"google","label":"Adsense Code","description":"Specify the Google adsense code here. For example, please refer to the codes below.","keywords":"adsense code the specify google adsense code here for example please refer"},{"id":"e28c84ab36002a2b","page":"integrations","tab":"google","label":"Adsense Responsive Code","description":"Specify the Google Adsense Responsive code here. For example, please refer to the codes below.","keywords":"adsense responsive code the specify google adsense responsive code here for example please"},{"id":"f5de7bb6d0472ce1","page":"integrations","tab":"google","label":"Display","description":"Choose where to display you google adsense in question post page.","keywords":"display choose where display you google adsense question post page"},{"id":"3dc20c82b3ae3986","page":"integrations","tab":"google","label":"Show to","description":"Configure the adsense to be displayed to members, guests or both","keywords":"show configure the adsense displayed members guests both"},{"id":"eff86978036e8570","page":"integrations","tab":"jfbconnect","label":"Enable JFBConnect","description":"Turn on JFBConnect integration.","keywords":"enable jfbconnect turn jfbconnect integration"},{"id":"74dd253e18b5256f","page":"integrations","tab":"jomsocial","label":"Integrate With Jomsocial User Points","description":"If enabled, EasyDiscuss will use the point systems in Jomsocial","keywords":"integrate with jomsocial user points enabled easydiscuss will use the point systems jomsocial"},{"id":"1bcaa47fdf02c3cd","page":"integrations","tab":"jomsocial","label":"Update Edit Profile Link","description":"When enabled, the edit profile link in the toolbar will be linked to JomSocial's edit profile instead","keywords":"update edit profile link the edit profile when enabled link toolbar will linked jomsocials"},{"id":"bf406712b68bb90c","page":"integrations","tab":"jomsocial","label":"Use JomSocial Messaging","description":"If enabled, EasyDiscuss will use the messaging from JomSocial instead of its own private messaging","keywords":"use jomsocial messaging messaging enabled easydiscuss will use the from jomsocial instead its"},{"id":"789c71b2c8d5c096","page":"integrations","tab":"jomsocial","label":"Integrate With JomSocial Activity Stream","description":"When this option is enabled, EasyDiscuss will create activity stream items in Jomsocial","keywords":"integrate with jomsocial activity stream when this option enabled easydiscuss will create activity stream items"},{"id":"f6f477ea8d0a85fb","page":"layout","tab":"general","label":"Enable Dark Mode","description":"This option determines if the layout of EasyDiscuss should be rendered in dark mode","keywords":"enable dark mode this option determines the layout easydiscuss should rendered dark mode"},{"id":"9953c8d77e320ea4","page":"layout","tab":"general","label":"Posts Per Page (Global)","description":"Set the total number of items to be displayed per page.","keywords":"posts per page global set the total number items displayed per page"},{"id":"3f939d6530787a96","page":"layout","tab":"general","label":"Days Post Stay As New","description":"This determines the number of days for a post to stay as new","keywords":"days post stay new this determines the number days for post stay new"},{"id":"059cc2fa52f6ee76","page":"layout","tab":"general","label":"Zero As Plural","description":"This option determines if the value 0 would be treated as plural instead. This is useful for sites that runs on a different locale.","keywords":"zero plural this option determines the value would treated plural instead useful"},{"id":"938c12cbd2d13f2f","page":"layout","tab":"general","label":"Attach Custom CSS","description":"When this option is enabled, EasyDiscuss will attach the custom.css file placed in the template override folder","keywords":"attach custom css the when this option enabled easydiscuss will attach customcss file"},{"id":"4316f34951592b5a","page":"layout","tab":"general","label":"Wrapper Class Suffix","description":"This settings allows you to specify a css class name at the wrapper of EasyDiscuss. This allows you to have greater control over EasyDiscuss styling.","keywords":"wrapper class suffix this allows you easydiscuss settings specify css class name the"},{"id":"40c4e5bd424c54f9","page":"layout","tab":"general","label":"Display Powered By Link","description":"By enabling this option, a powered by link will appear at the bottom of the extension","keywords":"display powered link the enabling this option powered link will appear bottom extension"},{"id":"4b029b0584ede023","page":"layout","tab":"general","label":"Render Font Awesome v5 Stylesheets","description":"If your template already loads Font Awesome 5, you can turn this option off so that the site does not need to render multiple Font Awesome libraries","keywords":"render font awesome stylesheets font awesome your that multiple render need not does site"},{"id":"b8f65e615b8cd036","page":"layout","tab":"general","label":"Render Prism Stylesheets","description":"If your template already loads Prism stylesheets, you can turn this option off so that the site does not override your template Prism stylesheets","keywords":"render prism stylesheets your prism stylesheets template off not does site the that"},{"id":"3bbe256ab0187e84","page":"layout","tab":"general","label":"Schema Logo","description":"This will be used as a logo for your structured data. The size of the logo should be 60px width x 60px height.","keywords":"schema logo the logo 60px this will used for your structured data"},{"id":"32b0538a97df2dee","page":"layout","tab":"category","label":"Use Icons As Category Identifier","description":"When this option is enabled, icons will be used instead of the category avatars","keywords":"use icons category identifier when this option enabled icons will used instead the category"},{"id":"9c1d28c529fb7bc4","page":"layout","tab":"category","label":"Storage Path For Category Avatars","description":"Set the relative path to the categories avatar location. You will need to manually move the images to the new destination when you modify existing path","keywords":"storage path for category avatars the path you set move modify when destination new images"},{"id":"00eea8a14934db17","page":"layout","tab":"category","label":"Category Ordering Behavior","description":"Select the default ordering behavior of categories in the category listings","keywords":"category ordering behavior the select default ordering behavior categories category listings"},{"id":"22c2fd7a2fde3192","page":"layout","tab":"category","label":"Catgory Sorting Behavior","description":"Select the default sorting behavior of the categories in the category listings","keywords":"catgory sorting behavior the select default sorting behavior categories category listings"},{"id":"a1e27a50c87a4f30","page":"layout","tab":"category","label":"Posts Per Page In Single Category View","description":"Set the number of posts per page when viewing in single category page.","keywords":"posts per page single category view page set the number posts per when viewing single category"},{"id":"39804e2c0498f583","page":"layout","tab":"post","label":"Enable Pagination For Replies","description":"This option determines if pagination should be enabled for replies in a post. If this is disabled, all replies will be shown on the page","keywords":"enable pagination for replies this replies option determines pagination should enabled for post disabled"},{"id":"153fd99668ca98cf","page":"layout","tab":"post","label":"Replies Per Page","description":"Set the limit of replies to be displayed per discussion","keywords":"replies per page set the limit replies displayed per discussion"},{"id":"0ef2870af561da7b","page":"layout","tab":"post","label":"Display Print Button","description":"If enabled, print button will be shown in discussion.","keywords":"display print button enabled print button will shown discussion"},{"id":"0b0ffce05a2ffc5d","page":"layout","tab":"post","label":"Enable Who Is Viewing Section","description":"If enabled, EasyDiscuss will display the who's viewing section in the front page as well as the question's page.","keywords":"enable who viewing section the page enabled easydiscuss will display whos viewing section front"},{"id":"0239cd00299185b0","page":"layout","tab":"post","label":"Post Activity Logs","description":"This option determines if post's activity logs should be visible to every or moderators only or, post's activity logs should be disabled in EasyDiscuss.","keywords":"post activity logs posts activity logs should this option determines visible every moderators"},{"id":"59c6f30ab7791309","page":"layout","tab":"post","label":"Default Replies Ordering","description":"Configure the default ordering for replies in a discussion page.","keywords":"default replies ordering configure the default ordering for replies discussion page"},{"id":"d60f798028b93671","page":"layout","tab":"post","label":"Replies Date Source","description":"Determines the date source for the replies that should be used. If is set to <b>Default<\/b>, the replies date will be shown in duration.","keywords":"replies date source the date replies determines source for that should used set"},{"id":"b20dd74a43da4f1a","page":"layout","tab":"post","label":"Enable Live Updates (Replies & Comments)","description":"This option determines if EasyDiscuss should notify the user whenever a new reply or comment is posted while the user is viewing the page.","keywords":"enable live updates replies comments the user this option determines easydiscuss should notify whenever new"},{"id":"99c3bb32fa91fd2c","page":"layout","tab":"recent","label":"Display Resolved Filter","description":"If enabled, users would be able to filter through discussions that are resolved","keywords":"display resolved filter enabled users would able filter through discussions that are resolved"},{"id":"73150cd32720d0cc","page":"layout","tab":"recent","label":"Display Unresolved Filter","description":"If enabled, users are able to filter through discussions that are unresolved","keywords":"display unresolved filter are enabled users able filter through discussions that unresolved"},{"id":"2e6246cb03c89288","page":"layout","tab":"recent","label":"Display Unanswered Filter","description":"If enabled, users are able to filter through discussions that are unanswered","keywords":"display unanswered filter are enabled users able filter through discussions that unanswered"},{"id":"f24e0869d5048eef","page":"layout","tab":"recent","label":"Display Unread Filter","description":"If enabled, users are able to filter through discussions that are unread","keywords":"display unread filter are enabled users able filter through discussions that unread"},{"id":"be6f28f5e995e8f9","page":"layout","tab":"recent","label":"Enable My Posts Filter","description":"This option determines if the My Posts filter should be available to the user when filtering posts","keywords":"enable posts filter the posts this option determines filter should available user when"},{"id":"237ce4dd9d3e3d22","page":"layout","tab":"recent","label":"Enable Assigned Filter","description":"This option determines if the Assigned to me filter should be available to the user when filtering posts","keywords":"enable assigned filter the this option determines assigned filter should available user when"},{"id":"8db89b4eeb8e7abc","page":"layout","tab":"toolbars","label":"Display Toolbar","description":"This option determines if the toolbar beneath the headers should be visible or hidden.","keywords":"display toolbar the this option determines toolbar beneath headers should visible hidden"},{"id":"a6e247387909dde5","page":"layout","tab":"toolbars","label":"Show Home","description":"If enabled, the home link (forums) will be displayed in the toolbar.","keywords":"show home the enabled home link forums will displayed toolbar"},{"id":"2808d3ef08a8c34d","page":"layout","tab":"toolbars","label":"Show Tags","description":"If enabled, tags button will be displayed in the toolbar","keywords":"show tags enabled tags button will displayed the toolbar"},{"id":"c3ebecec43e2403d","page":"layout","tab":"toolbars","label":"Show Categories","description":"If enabled, categories button will be displayed in the toolbar","keywords":"show categories enabled categories button will displayed the toolbar"},{"id":"889ac74e3bb7b0af","page":"layout","tab":"toolbars","label":"Show Users","description":"If enabled, users link will be displayed in the toolbar","keywords":"show users enabled users link will displayed the toolbar"},{"id":"8bff22fcb597a88e","page":"layout","tab":"toolbars","label":"Show Badges","description":"If enabled, badges link will be displayed in the toolbar.","keywords":"show badges enabled badges link will displayed the toolbar"},{"id":"a834b3d99fc4d9e6","page":"layout","tab":"toolbars","label":"Show More Settings","description":"If enabled, profile button will be displayed","keywords":"show more settings enabled profile button will displayed"},{"id":"1445eb13b5142a9a","page":"layout","tab":"toolbars","label":"Show Sign-in Button","description":"If enabled, users can click on the login button in the toolbar to display a login form","keywords":"show signin button the login enabled users can click button toolbar display form"},{"id":"37b53b5408dddaaa","page":"layout","tab":"toolbars","label":"Show Conversations","description":"This option determines if the conversation button in the toolbar should be visible or hidden","keywords":"show conversations the this option determines conversation button toolbar should visible hidden"},{"id":"618fbe6c9cd977d7","page":"layout","tab":"toolbars","label":"Show Notifications","description":"This option determines if the notification button in the toolbar should be visible or hidden","keywords":"show notifications the this option determines notification button toolbar should visible hidden"},{"id":"49b1c847f019874b","page":"layout","tab":"toolbars","label":"Display RSS Link","description":"If enabled, subscribe via RSS feed will be displayed throughout the component","keywords":"display rss link enabled subscribe via rss feed will displayed throughout the component"},{"id":"d77c06073a950bf1","page":"layout","tab":"toolbars","label":"Show Search Input","description":"If enabled, a search bar would appear above the toolbar.","keywords":"show search input enabled search bar would appear above the toolbar"},{"id":"82ff9bcec63169ee","page":"notifications","tab":"general","label":"Sender Name","description":"Specify the sender's name to use when sending out e-mail notifications","keywords":"sender name specify the senders name use when sending out email notifications"},{"id":"228096a47b2ce323","page":"notifications","tab":"general","label":"Sender E-mail Address","description":"Specify the e-mail address to be used to send out e-mails from EasyDiscuss","keywords":"sender email address specify the email address used send out emails from easydiscuss"},{"id":"762c85bc6e2ddf87","page":"notifications","tab":"general","label":"Send Copy To Custom E-mail Addresses","description":"If you would like a copy of the notification to be sent to other e-mail addresses, you can specify them here. Separate each e-mail address with a comma to send to multiple e-mail addresses","keywords":"send copy custom email addresses email you addresses them send comma with address each separate"},{"id":"d536aeb53fbb59cf","page":"notifications","tab":"general","label":"Send E-mails During Page Load","description":"When enabled, emails will be sent when the page loads. This will cause the page to load a little slower when a request is made.","keywords":"send emails during page load when will the page enabled emails sent loads this cause"},{"id":"c9e1d61b4619f826","page":"notifications","tab":"general","label":"Email Logo","description":"This option allows you to define a custom logo for your e-mails","keywords":"email logo this option allows you define custom logo for your emails"},{"id":"601b95833f6e4bd1","page":"notifications","tab":"general","label":"Total E-mails To Process","description":"This option determines the total number of e-mails to process each time the cron executes","keywords":"total emails process the this option determines total number emails process each time"},{"id":"902611c15b83f7a9","page":"notifications","tab":"general","label":"Truncate E-mail Contents","description":"This option enforces truncation on the e-mail contents. If you do not want to limit the contents, set this value to 0","keywords":"truncate email contents this the contents option enforces truncation email you not want"},{"id":"070be3ee45a80ccd","page":"notifications","tab":"general","label":"Modify Sender Details to User Details","description":"When this option is activated, EasyDiscuss will modify the from name and e-mail address to the user that generated the notification","keywords":"details modify sender user the when and generated that user address email from name"},{"id":"e20f61a584fcbc6a","page":"notifications","tab":"general","label":"Notify Administrators On New Posts","description":"If enabled, the system will send a notification email to the site admins","keywords":"notify administrators new posts the enabled system will send notification email site admins"},{"id":"98c032b4df643ae5","page":"notifications","tab":"general","label":"Notify Administrators On New Replies","description":"If this is enabled, admin will always receive a new notification email when anyone post any replies on the site.","keywords":"notify administrators new replies this enabled admin will always receive new notification email when"},{"id":"4f4533476c069f30","page":"notifications","tab":"general","label":"Notify Moderators On New Posts","description":"If this is enabled, moderators will always receive a new notification email when anyone creates a new post in the category that they posted into.","keywords":"notify moderators new posts new this creates posted they that category the post when"},{"id":"818fc9f60558aab1","page":"notifications","tab":"general","label":"Notify Moderators On New Replies","description":"If this is enabled, moderators will always receive a new notification email when anyone replies to a discussion in the specific category.","keywords":"notify moderators new replies this enabled moderators will always receive new notification email when"},{"id":"1de46baa740a0a2e","page":"notifications","tab":"general","label":"Notify All Users On New Post","description":"By enabling this, all users would be notified when a new discussion is created on the site. Disregards the (Notify Specific Joomla User Groups) setting.","keywords":"notify all users new post the enabling groups user joomla specific notify disregards site created"},{"id":"36ff12c30e67e6e0","page":"notifications","tab":"general","label":"Notify All Users On New Replies","description":"If enabled, an email will be sent to all user with respect to category's view reply permission when a new reply is added","keywords":"notify all users new replies reply enabled email will sent all user with respect categorys"},{"id":"0f236f1f515a0e5b","page":"notifications","tab":"general","label":"Respect Category Permissions When Notifying All Users","description":"When this option is activated, EasyDiscuss will check for the category permissions and will only notify users who can view the post from the category permissions.","keywords":"respect category permissions when notifying all users the permissions will category only post view can who users"},{"id":"6e351a8d1b384a92","page":"notifications","tab":"general","label":"Notify Thread Participants When Replied","description":"IF enabled, system will notify all partipants in the post when someone replied.","keywords":"notify thread participants when replied enabled system will notify all partipants the post when someone"},{"id":"b8c3a0be4f20a683","page":"notifications","tab":"general","label":"Notify Owner When Replied","description":"If enabled, the system will notify the owner of the post when there is a new reply","keywords":"notify owner when replied the enabled system will notify owner post when there new"},{"id":"2229a780bb25d085","page":"notifications","tab":"general","label":"Notify Post Subscribers When Replied","description":"If enabled, the system will notify users which subscribe to the post when there is a new reply","keywords":"notify post subscribers when replied the enabled system will notify users which subscribe post when"},{"id":"f879989dec377c51","page":"notifications","tab":"general","label":"Notify Post Owner When Answer Is Chosen","description":"When enabled, owner of the post question will get notify when someone mark a reply as answered or un-answered.","keywords":"notify post owner when answer chosen when enabled owner the post question will get notify someone"},{"id":"7d2847bdca703975","page":"notifications","tab":"general","label":"Notify Post Owner When Post is Liked","description":"When enabled, owner of the post will get notify when someone like the post reply or question.","keywords":"post notify owner when liked when the post enabled owner will get notify someone like"},{"id":"eb85d437f88b2d8b","page":"notifications","tab":"general","label":"Notify User When Their Name Is Mentioned","description":"When enabled, system will send an email notification to user when their name being mentioned in post reply or question.","keywords":"notify user when their name mentioned when enabled system will send email notification user their name"},{"id":"2ab2ae9d711a0f83","page":"notifications","tab":"general","label":"Notify User For Their Own Actions","description":"When enabled, system will send an email notification to user when they create a new post, reply or comment on the site.","keywords":"notify user for their own actions when enabled system will send email notification user they create"},{"id":"f4a408ea09e3714e","page":"notifications","tab":"general","label":"Notify All Users On New Comments","description":"If enabled, an email will be sent to all user with respect to category's view discussion when new comment is added","keywords":"notify all users new comments enabled email will sent all user with respect categorys view"},{"id":"f930a98a710a1013","page":"notifications","tab":"general","label":"Notify Comment Participants In Post","description":"If enabled, the system will notify all comment participants for the particular question\/reply when a new comment is made.<br>The owner of the question\/reply will always receive comment notifications.","keywords":"notify comment participants post comment the questionreply will enabled receive always owner made<br>the new"},{"id":"0e104f7309c3f810","page":"notifications","tab":"general","label":"Notify Specific Joomla User Groups (New Post)\n                \n                     Public\n                \n            \n                \n                     Guest\n                \n            \n                \n                     Manager\n                \n            \n                \n                     Administrator\n                \n            \n                \n                     Registered\n                \n            \n                \n                     Author\n                \n            \n                \n                     Editor\n                \n            \n                \n                     Publisher\n                \n            \n                \n                     Super Users","description":"When this option is enabled, EasyDiscuss will only notify the user groups selected. Disable the (Notify all users on new post) setting for this to work properly.","keywords":"notify specific joomla user groups new postpublicguestmanageradministratorregisteredauthoreditorpublishersuper users the notify this when all work for setting post new"},{"id":"59d7c92bc34688ab","page":"notifications","tab":"alerts","label":"Enable System Notifications","description":"If enabled, notifications will be displayed in the toolbar allowing instant live updates.","keywords":"enable system notifications enabled notifications will displayed the toolbar allowing instant live updates"},{"id":"cf1ae86afc4ff5c5","page":"notifications","tab":"alerts","label":"Maximum Notifications Displayed","description":"This option determines the total number of alerts that appears in the dropdown","keywords":"maximum notifications displayed the this option determines total number alerts that appears dropdown"},{"id":"80c8bc261992e1b0","page":"notifications","tab":"alerts","label":"Polling Interval","description":"Set the number of seconds to poll for new notifications.","keywords":"polling interval set the number seconds poll for new notifications"},{"id":"5c0553474f022749","page":"notifications","tab":"alerts","label":"Notification Limit","description":"Set the number of limit notifications you want to display in your notification listing.","keywords":"notification limit set the number limit notifications you want display your notification"},{"id":"e378590e685a685e","page":"notifications","tab":"subscription","label":"Enable Site Wide Subscription","description":"Site wide subscriptions are great to allow users to subscribe to site wide discussion updates","keywords":"enable site wide subscription site wide subscriptions are great allow users subscribe discussion updates"},{"id":"63bb629e045bf919","page":"notifications","tab":"subscription","label":"Enable Category Subscription","description":"If enabled, users will be allowed to subscribe to categories.","keywords":"enable category subscription enabled users will allowed subscribe categories"},{"id":"958865874a5e46c6","page":"notifications","tab":"subscription","label":"Include Replies In Subscriptions","description":"If enabled, users will also be notified when new replies are posted","keywords":"include replies subscriptions enabled users will also notified when new replies are posted"},{"id":"1fe879a74679ed4a","page":"notifications","tab":"subscription","label":"Include Comments In Subscriptions","description":"If enabled, users will also be notified when new comments are posted","keywords":"include comments subscriptions enabled users will also notified when new comments are posted"},{"id":"fc2957f9fbcde21b","page":"notifications","tab":"subscription","label":"Enable Single Post Subscription","description":"If enabled, users will be allowed to subscribe to questions.","keywords":"enable single post subscription enabled users will allowed subscribe questions"},{"id":"27cd9731e6da8672","page":"notifications","tab":"subscription","label":"Auto Subscribe When Replying To Topic","description":"When this option enabled, user will automatically subscribed to the topic that the user posted the reply. This option required 'Allow post subscriptions' to be enabled.","keywords":"auto subscribe when replying topic the option enabled user this posted post allow required reply"},{"id":"91b0fc365de4bbbb","page":"notifications","tab":"subscription","label":"Auto Subscribe User When They Register","description":"When this option enabled, EasyDiscuss will automatically subscribe the user to sitewide subscription when they register on the site.","keywords":"auto subscribe user when they register the when this option enabled easydiscuss will automatically subscribe user"},{"id":"af6320d82f8edefa","page":"notifications","tab":"subscription","label":"Auto Subscribe Author To Their Own New Post","description":"When this option enabled, EasyDiscuss will automatically subscribe the author to their own post when they created new discussion posts.","keywords":"auto subscribe author their own new post when their discussion new created they post own author this"},{"id":"c775496b98e2f34c","page":"notifications","tab":"subscription","label":"Moderator Auto Subscribe When Replying To Topic","description":"When this option enabled, moderator will automatically subscribed to the topic that he\/she posted the reply. This option required 'Auto Subscribe When Replying To Topic' to be enabled.","keywords":"moderator auto subscribe when replying topic when the this topic enabled option moderator will automatically subscribed"},{"id":"9bdf4bcea37b410d","page":"notifications","tab":"subscription","label":"Allow Non Registered Users To Subscribe","description":"If enabled, guests are allowed to subscribe for updates","keywords":"allow non registered users subscribe enabled guests are allowed subscribe for updates"},{"id":"1449a398175417b0","page":"notifications","tab":"subscription","label":"Enable Email Digest","description":"If enabled, the system will send a notification email based on interval selected by users.","keywords":"enable email digest enabled the system will send notification email based interval selected"},{"id":"5c0f7a384e728fef","page":"notifications","tab":"subscription","label":"Default Interval","description":"This options determine for the new user subsribe on the site, it will automatically set to this subscription interval.","keywords":"default interval this the options determine for new user subsribe site will"},{"id":"a7e96f9b1d7b2990","page":"notifications","tab":"subscription","label":"Include Post Replies","description":"If enabled, the system will include new post's replies into email digest.","keywords":"include post replies enabled the system will include new posts replies into email"},{"id":"4ec8ac63a8608dfa","page":"notifications","tab":"subscription","label":"Include New Comments","description":"If enabled, the system will include new comments that are associated with posts where user subscribed for email digest.","keywords":"include new comments enabled with email for subscribed user where posts associated the"},{"id":"a64ba49a3e6ead98","page":"seo","tab":"general","label":"Allow Unicode Aliases","description":"If enabled, EasyDiscuss will allow unicode aliases to be used as permalink throughout the site","keywords":"allow unicode aliases enabled easydiscuss will allow unicode aliases used permalink throughout the"},{"id":"3d57f0c19e59c9b1","page":"seo","tab":"general","label":"User Permalink Format","description":"Determines if EasyDiscuss should use the username or real name as the permalink format","keywords":"user permalink format the determines easydiscuss should use username real name permalink format"},{"id":"319245a8c2958408","page":"seo","tab":"general","label":"System Routing Behavior","description":"Choose EasyDiscuss routing behavior when Joomla SEF enabled.","keywords":"system routing behavior choose easydiscuss routing behavior when joomla sef enabled"},{"id":"57d9ed639fde27db","page":"seo","tab":"general","label":"Enable AMP Support","description":"This option determines if Accelerated Mobile Pages should be turned on. This helps Google to index your site on mobile devices as search engines are now providing higher ranking for pages that supports AMP","keywords":"enable amp support this mobile pages search supports that for ranking higher providing"},{"id":"e839c439fcbdd307","page":"seo","tab":"general","label":"Logo","description":"This logo will be used for your AMP page's header","keywords":"logo this logo will used for your amp pages header"},{"id":"03cf7995448f9dc3","page":"seo","tab":"general","label":"URL Format For Post View","description":"Select the desired SEF URL Format for your entry permalink.","keywords":"url format for post view select the desired sef url format for your entry permalink"},{"id":"409162262ab4b9ff","page":"system","tab":"general","label":"Enable CDN","description":"By enabling this, all assets files such as css, javascripts and images would be loaded on the site with the specified cdn url below.","keywords":"enable cdn the enabling would url cdn specified with site loaded images"},{"id":"3393a1f38669e4fd","page":"system","tab":"general","label":"CDN Url","description":"Enter the CDN Url.","keywords":"cdn url enter the cdn url"},{"id":"f98d710f68c66d0e","page":"system","tab":"general","label":"Load jQuery (Recommended to leave it on)","description":"If your site already has the latest jquery and would like EasyDiscuss to use the site's jquery, turn this option off.","keywords":"load jquery recommended leave jquery the your easydiscuss option this turn sites use would"},{"id":"a4a50969401cbc48","page":"system","tab":"general","label":"Use index.php For AJAX Requests","description":"There are times when the directory index is set to a different url and AJAX calls may fail. Turn this option on to enforce EasyDiscuss to use index.php in all of it's AJAX requests.","keywords":"use indexphp for ajax requests ajax there fail its all indexphp use easydiscuss enforce option"},{"id":"152c96c75e41cb99","page":"system","tab":"general","label":"Enable Error Redirection","description":"By enabling this, user will be redirected to easydiscuss frontpage instead of error 404 page. However this will only apply to certain area as there are special case where easydiscuss will still need to use error 404 handler to sustain the system.","keywords":"enable error redirection will easydiscuss error this enabling are the sustain handler use"},{"id":"82553ef523702880","page":"system","tab":"general","label":"Query Behavior For Pagination","description":"Determine the query behavior used in the system's pagination.","keywords":"query behavior for pagination the determine query behavior used systems pagination"},{"id":"4d02b82ef45f6176","page":"system","tab":"general","label":"Prune Notifications During Cronjob","description":"When enabled, notification items will be pruned when cron job is executed.","keywords":"prune notifications during cronjob when enabled notification items will pruned cron job executed"},{"id":"a06365ff4e02f294","page":"system","tab":"general","label":"Prune Notifications On Page Load","description":"When enabled, notification items will be pruned when the page is loaded.","keywords":"prune notifications page load when enabled notification items will pruned the page loaded"},{"id":"c2ce7a993c043df0","page":"system","tab":"general","label":"Delete Notifications After","description":"Specify the number of days to keep the notifications before it gets pruned.","keywords":"delete notifications after the specify number days keep notifications before gets pruned"},{"id":"00264f23c8536540","page":"system","tab":"general","label":"Owner For Orphan Items","description":"When a user is deleted from the site, EasyDiscuss needs to assign posts that belongs to the user to a different user. By specifying the user here, EasyDiscuss will assign the posts to the user selected here","keywords":"owner for orphan items user the assign here easydiscuss posts belongs will specifying different"},{"id":"e0076a77f7ad58fd","page":"users","tab":"general","label":"Display Name format","description":"This option determines the display name format that should be used throughout the site","keywords":"display name format the this option determines display name format that should used"},{"id":"96ac3f71f31a31c1","page":"users","tab":"general","label":"Show User Social Profiles","description":"If enabled, user is able to input their social details when editing their account.","keywords":"show user social profiles their enabled user able input social details when editing account"},{"id":"b1993cd43d053970","page":"users","tab":"general","label":"Show Online State","description":"This option determines if the online state of the user would be visible","keywords":"show online state the this option determines online state user would visible"},{"id":"60805361a8617ece","page":"users","tab":"general","label":"Show Signature","description":"By enabling this option, user signature would appear beneath each of their posts on the site","keywords":"show signature enabling this option user signature would appear beneath each their"},{"id":"32c434fed7b5340d","page":"users","tab":"general","label":"Allow Public Guests To View User Profile","description":"When this option is disabled, only logged in users would be able to view user's profile.","keywords":"allow public guests view user profile users when this option disabled only logged would able view"},{"id":"bf23d3b6770a1ae9","page":"users","tab":"general","label":"Allow Account Downloads","description":"In accordance to the GDPR ruling by the EU, users should be allowed to download data for their account. If your site resides in the EU or if you prefer to allow user to backup their own data, you should enable this option","keywords":"allow account downloads the you should data their accordance this enable own backup"},{"id":"eb2098c301da48e1","page":"users","tab":"general","label":"Download Archive Expiration","description":"To save disk space on the site, EasyDiscuss will automatically delete generated files. Specify the number of days before these files are marked as expired and should be deleted from the site","keywords":"download archive expiration the site files save before deleted should and expired marked"},{"id":"7a24dcf3a1dcad5d","page":"users","tab":"general","label":"Enable Ranking","description":"Enable or disable ranking system within EasyDiscuss","keywords":"enable ranking enable disable ranking system within easydiscuss"},{"id":"3a5e4708f631543b","page":"users","tab":"general","label":"User Ranking Based On","description":"Select the ranking calculation criteria.","keywords":"user ranking based select the ranking calculation criteria"},{"id":"00e991cacedbe0a6","page":"users","tab":"general","label":"Allow User Listings","description":"This option determines if the user listing feature should be enabled or disabled","keywords":"allow user listings this option determines the user listing feature should enabled disabled"},{"id":"50e70675315e45b2","page":"users","tab":"general","label":"Exclude Users From Listing","description":"Insert user id's that you want to hide from the user's listing. Each id should be separate by a comma.","keywords":"exclude users from listing insert user ids that you want hide from the users"},{"id":"9cb7db2bde485821","page":"users","tab":"avatars","label":"Profile Picture Integrations","description":"If you would like to use avatars from a 3rd party solution, select the component here","keywords":"profile picture integrations you would like use avatars from 3rd party solution select"},{"id":"76830fd4fb835338","page":"users","tab":"avatars","label":"Use Text Based Avatars","description":"If enabled, EasyDiscuss will use text based avatars generated based on their names instead","keywords":"use text based avatars based enabled easydiscuss will use text avatars generated their names"},{"id":"92e6860163d71ddb","page":"users","tab":"avatars","label":"Show User Badges in Post","description":"When this option is activated, post owner badges would appear alongside the post","keywords":"show user badges post post when this option activated owner badges would appear alongside"},{"id":"c257d2a925b5c734","page":"users","tab":"avatars","label":"Large Thumbnail Size","description":"Set the size for large thumbnail pictures. The image will be in 1:1 ratio.","keywords":"large thumbnail size the set size for large thumbnail pictures image will ratio"},{"id":"9253e79f293f1a2c","page":"users","tab":"avatars","label":"Small Thumbnail Size","description":"Set the size for large thumbnail pictures. The image will be in 1:1 ratio.","keywords":"small thumbnail size the set size for large thumbnail pictures image will ratio"},{"id":"5b89e8cacc03501a","page":"users","tab":"avatars","label":"Maximum Upload Size","description":"Set the allowed maximum size of files","keywords":"maximum upload size set the allowed maximum size files"},{"id":"84df5411e151d7e9","page":"users","tab":"avatars","label":"Original avatar size","description":"The original size of avatar when user upload in frontend edit profile. The image will be in 1:1 ratio.","keywords":"original avatar size the original size avatar when user upload frontend edit profile"},{"id":"fb9d560d9b728fa4","page":"users","tab":"avatars","label":"Avatar storage path","description":"Set the path where we should store the avatars. It is relative to your site","keywords":"avatar storage path the set path where should store avatars relative your site"},{"id":"90187303e9571ac3","page":"users","tab":"login","label":"Select Login Provider","description":"Choose which component EasyDiscuss should link the registrations and login with.","keywords":"select login provider choose which component easydiscuss should link the registrations and login"},{"id":"9c84ad495e1996ae","page":"users","tab":"login","label":"Login Redirection Page","description":"This option determines which page should the user get redirected to upon logging in","keywords":"login redirection page this option determines which page should the user get redirected"},{"id":"30b6af9ade5d8211","page":"users","tab":"login","label":"Logout Redirection Page","description":"This option determines which page should the user get redirected to upon logging out","keywords":"logout redirection page this option determines which page should the user get redirected"},{"id":"3ebcfab39125c8c8","page":"work","tab":"general","label":"Enable Work Schedule","description":"Determine if site require work scheduling or not.","keywords":"enable work schedule determine site require work scheduling not"},{"id":"62454d6429443a6f","page":"work","tab":"general","label":"Display Time Comparison","description":"When this option is enabled, the time comparison between the user and the server will be displayed","keywords":"display time comparison the when this option enabled time comparison between user and"},{"id":"25840b99b8d75a9e","page":"work","tab":"general","label":"Work Days\n\t\t\t\t\t\t\t\t\tMonday\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tTuesday\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tWednesday\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tThursday\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tFriday\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tSaturday\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\tSunday","description":"Specify which day are the working days for the site.","keywords":"work daysmondaytuesdaywednesdaythursdayfridaysaturdaysunday the specify which day are working days for site"},{"id":"a62549812e0ecb64","page":"work","tab":"general","label":"Working HoursFrom:Till:","description":"Specify the working hours for the site.","keywords":"working hoursfromtill the specify working hours for site"},{"id":"bcf1871dba0cdbb4","page":"work","tab":"general","label":"Work Hour Display Format\n\t\t\t\t\t\t\t\t\t12 hours format\t\t\t\t\t\t\t\t\n\t\t\t\t\t\t\t\t\t24 hours format","description":"Determine the hour display format. <br ><\/i>For 12 hours, the hour will show as 1:00PM. <br \/>For 24 hours, the hour will show as 13:00.","keywords":"hours work hour display format12 format24 format the hour <br hours will show determine display format ><i>for"}]}